reports/333-node.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 2.299ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.293ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.289ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.66ms    7.64ms  99.52ms   96.81%
    Req/Sec     3.52k     0.90k   11.22k    92.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.31ms
 75.000%    1.83ms
 90.000%    2.46ms
 99.000%   47.39ms
 99.900%   87.55ms
 99.990%   96.00ms
 99.999%   98.56ms
100.000%   99.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.079     0.000000            1         1.00
       0.577     0.100000        49510         1.11
       0.781     0.200000        98999         1.25
       0.959     0.300000       148571         1.43
       1.131     0.400000       197850         1.67
       1.309     0.500000       247441         2.00
       1.402     0.550000       272125         2.22
       1.499     0.600000       296878         2.50
       1.600     0.650000       321424         2.86
       1.709     0.700000       346338         3.33
       1.829     0.750000       370938         4.00
       1.896     0.775000       383234         4.44
       1.971     0.800000       395677         5.00
       2.055     0.825000       408065         5.71
       2.155     0.850000       420381         6.67
       2.283     0.875000       432765         8.00
       2.363     0.887500       438887         8.89
       2.461     0.900000       445098        10.00
       2.589     0.912500       451234        11.43
       2.783     0.925000       457374        13.33
       3.247     0.937500       463555        16.00
       4.021     0.943750       466634        17.78
       5.007     0.950000       469725        20.00
       6.023     0.956250       472820        22.86
       7.207     0.962500       475904        26.67
      11.575     0.968750       478993        32.00
      16.591     0.971875       480538        35.56
      21.791     0.975000       482084        40.00
      26.639     0.978125       483630        45.71
      32.143     0.981250       485175        53.33
      37.631     0.984375       486726        64.00
      40.287     0.985938       487493        71.11
      42.943     0.987500       488266        80.00
      45.599     0.989062       489037        91.43
      48.319     0.990625       489810       106.67
      50.879     0.992188       490590       128.00
      52.319     0.992969       490972       142.22
      53.823     0.993750       491355       160.00
      55.871     0.994531       491742       182.86
      58.879     0.995313       492129       213.33
      62.719     0.996094       492513       256.00
      65.055     0.996484       492707       284.44
      67.455     0.996875       492901       320.00
      69.887     0.997266       493095       365.71
      75.391     0.997656       493286       426.67
      79.679     0.998047       493479       512.00
      81.535     0.998242       493575       568.89
      83.391     0.998437       493677       640.00
      84.607     0.998633       493769       731.43
      85.631     0.998828       493866       853.33
      87.743     0.999023       493965      1024.00
      88.639     0.999121       494014      1137.78
      89.599     0.999219       494058      1280.00
      90.687     0.999316       494111      1462.86
      91.583     0.999414       494158      1706.67
      92.415     0.999512       494204      2048.00
      92.863     0.999561       494231      2275.56
      93.247     0.999609       494253      2560.00
      93.631     0.999658       494280      2925.71
      93.951     0.999707       494303      3413.33
      94.399     0.999756       494324      4096.00
      94.655     0.999780       494338      4551.11
      94.783     0.999805       494349      5120.00
      95.039     0.999829       494363      5851.43
      95.295     0.999854       494372      6826.67
      95.807     0.999878       494389      8192.00
      95.871     0.999890       494391      9102.22
      96.063     0.999902       494396     10240.00
      96.319     0.999915       494402     11702.86
      96.895     0.999927       494410     13653.33
      97.087     0.999939       494415     16384.00
      97.151     0.999945       494418     18204.44
      97.343     0.999951       494420     20480.00
      97.599     0.999957       494423     23405.71
      97.727     0.999963       494427     27306.67
      97.855     0.999969       494431     32768.00
      97.855     0.999973       494431     36408.89
      97.919     0.999976       494433     40960.00
      97.983     0.999979       494435     46811.43
      97.983     0.999982       494435     54613.33
      98.431     0.999985       494437     65536.00
      98.495     0.999986       494438     72817.78
      98.495     0.999988       494438     81920.00
      98.559     0.999989       494439     93622.86
      98.943     0.999991       494440    109226.67
      99.007     0.999992       494441    131072.00
      99.007     0.999993       494441    145635.56
      99.007     0.999994       494441    163840.00
      99.071     0.999995       494443    187245.71
      99.071     0.999995       494443    218453.33
      99.071     0.999996       494443    262144.00
      99.071     0.999997       494443    291271.11
      99.071     0.999997       494443    327680.00
      99.071     0.999997       494443    374491.43
      99.071     0.999998       494443    436906.67
      99.583     0.999998       494444    524288.00
      99.583     1.000000       494444          inf
#[Mean    =        2.658, StdDeviation   =        7.642]
#[Max     =       99.520, Total count    =       494444]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597337 requests in 1.00m, 57.54MB read
Requests/sec:   9955.52
Transfer/sec:      0.96MB