reports/333-ocaml-reason.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.731ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.741ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.736ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms    0.89ms  13.50ms   72.21%
    Req/Sec     3.51k   384.94     7.55k    72.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.61ms
 75.000%    2.26ms
 90.000%    2.93ms
 99.000%    4.42ms
 99.900%    6.12ms
 99.990%   11.80ms
 99.999%   12.94ms
100.000%   13.50ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.199     0.000000            1         1.00
       0.806     0.100000        49594         1.11
       1.017     0.200000        98883         1.25
       1.207     0.300000       148328         1.43
       1.400     0.400000       197914         1.67
       1.609     0.500000       247269         2.00
       1.722     0.550000       271965         2.22
       1.843     0.600000       296727         2.50
       1.971     0.650000       321453         2.86
       2.109     0.700000       346199         3.33
       2.261     0.750000       370899         4.00
       2.347     0.775000       383359         4.44
       2.437     0.800000       395728         5.00
       2.535     0.825000       407932         5.71
       2.649     0.850000       420444         6.67
       2.779     0.875000       432729         8.00
       2.851     0.887500       438875         8.89
       2.933     0.900000       445017        10.00
       3.025     0.912500       451184        11.43
       3.131     0.925000       457340        13.33
       3.261     0.937500       463557        16.00
       3.339     0.943750       466637        17.78
       3.423     0.950000       469714        20.00
       3.513     0.956250       472782        22.86
       3.617     0.962500       475869        26.67
       3.743     0.968750       478960        32.00
       3.811     0.971875       480535        35.56
       3.881     0.975000       482048        40.00
       3.963     0.978125       483628        45.71
       4.053     0.981250       485141        53.33
       4.163     0.984375       486702        64.00
       4.223     0.985938       487474        71.11
       4.291     0.987500       488263        80.00
       4.371     0.989062       489010        91.43
       4.463     0.990625       489794       106.67
       4.567     0.992188       490555       128.00
       4.627     0.992969       490941       142.22
       4.695     0.993750       491321       160.00
       4.771     0.994531       491708       182.86
       4.851     0.995313       492096       213.33
       4.967     0.996094       492482       256.00
       5.027     0.996484       492682       284.44
       5.083     0.996875       492860       320.00
       5.159     0.997266       493060       365.71
       5.251     0.997656       493248       426.67
       5.387     0.998047       493444       512.00
       5.479     0.998242       493542       568.89
       5.587     0.998437       493634       640.00
       5.719     0.998633       493732       731.43
       5.911     0.998828       493826       853.33
       6.139     0.999023       493925      1024.00
       6.283     0.999121       493971      1137.78
       6.519     0.999219       494019      1280.00
       6.967     0.999316       494068      1462.86
       7.831     0.999414       494116      1706.67
       8.647     0.999512       494164      2048.00
       9.271     0.999561       494188      2275.56
       9.663     0.999609       494212      2560.00
      10.055     0.999658       494237      2925.71
      10.255     0.999707       494261      3413.33
      10.775     0.999756       494285      4096.00
      10.959     0.999780       494297      4551.11
      11.071     0.999805       494310      5120.00
      11.215     0.999829       494321      5851.43
      11.503     0.999854       494333      6826.67
      11.663     0.999878       494345      8192.00
      11.767     0.999890       494351      9102.22
      11.807     0.999902       494357     10240.00
      11.887     0.999915       494363     11702.86
      11.919     0.999927       494370     13653.33
      11.983     0.999939       494376     16384.00
      11.991     0.999945       494378     18204.44
      12.143     0.999951       494382     20480.00
      12.231     0.999957       494384     23405.71
      12.327     0.999963       494387     27306.67
      12.375     0.999969       494390     32768.00
      12.407     0.999973       494392     36408.89
      12.431     0.999976       494393     40960.00
      12.655     0.999979       494395     46811.43
      12.679     0.999982       494396     54613.33
      12.687     0.999985       494398     65536.00
      12.695     0.999986       494399     72817.78
      12.695     0.999988       494399     81920.00
      12.935     0.999989       494400     93622.86
      13.127     0.999991       494401    109226.67
      13.167     0.999992       494402    131072.00
      13.167     0.999993       494402    145635.56
      13.167     0.999994       494402    163840.00
      13.215     0.999995       494403    187245.71
      13.215     0.999995       494403    218453.33
      13.407     0.999996       494404    262144.00
      13.407     0.999997       494404    291271.11
      13.407     0.999997       494404    327680.00
      13.407     0.999997       494404    374491.43
      13.407     0.999998       494404    436906.67
      13.503     0.999998       494405    524288.00
      13.503     1.000000       494405          inf
#[Mean    =        1.771, StdDeviation   =        0.892]
#[Max     =       13.496, Total count    =       494405]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597348 requests in 1.00m, 22.79MB read
Requests/sec:   9955.62
Transfer/sec:    388.89KB